wrk2/dome-no-cache/1024KB/wrk-eth3-rep10.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 835.433ms, rate sampling interval: 1994ms
  Thread calibration: mean lat.: 896.665ms, rate sampling interval: 1965ms
  Thread calibration: mean lat.: 781.656ms, rate sampling interval: 2012ms
  Thread calibration: mean lat.: 843.075ms, rate sampling interval: 2029ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   807.85ms  153.10ms   2.22s    80.11%
    Req/Sec    15.00      4.36    24.00     73.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  834.05ms
 75.000%  895.49ms
 90.000%  946.17ms
 99.000%    1.04s 
 99.900%    2.07s 
 99.990%    2.22s 
 99.999%    2.22s 
100.000%    2.22s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.983     0.000000            1         1.00
     636.415     0.100000          124         1.11
     712.191     0.200000          245         1.25
     771.583     0.300000          368         1.43
     805.375     0.400000          489         1.67
     834.047     0.500000          613         2.00
     846.847     0.550000          674         2.22
     857.599     0.600000          735         2.50
     868.863     0.650000          799         2.86
     880.127     0.700000          857         3.33
     895.487     0.750000          918         4.00
     903.167     0.775000          949         4.44
     910.847     0.800000          980         5.00
     919.039     0.825000         1009         5.71
     928.255     0.850000         1040         6.67
     935.935     0.875000         1072         8.00
     942.079     0.887500         1085         8.89
     946.175     0.900000         1100        10.00
     952.319     0.912500         1116        11.43
     963.583     0.925000         1132        13.33
     972.287     0.937500         1147        16.00
     976.895     0.943750         1154        17.78
     979.967     0.950000         1161        20.00
     987.647     0.956250         1169        22.86
     992.255     0.962500         1178        26.67
    1000.959     0.968750         1184        32.00
    1008.639     0.971875         1188        35.56
    1012.735     0.975000         1192        40.00
    1016.319     0.978125         1196        45.71
    1019.391     0.981250         1200        53.33
    1025.535     0.984375         1203        64.00
    1027.583     0.985938         1206        71.11
    1031.167     0.987500         1207        80.00
    1039.359     0.989062         1209        91.43
    1040.895     0.990625         1211       106.67
    1051.647     0.992188         1213       128.00
    1073.151     0.992969         1214       142.22
    1084.415     0.993750         1215       160.00
    1160.191     0.994531         1216       182.86
    1198.079     0.995313         1217       213.33
    1200.127     0.996094         1218       256.00
    1200.127     0.996484         1218       284.44
    1270.783     0.996875         1219       320.00
    1270.783     0.997266         1219       365.71
    1298.431     0.997656         1220       426.67
    1298.431     0.998047         1220       512.00
    1298.431     0.998242         1220       568.89
    2073.599     0.998437         1221       640.00
    2073.599     0.998633         1221       731.43
    2073.599     0.998828         1221       853.33
    2073.599     0.999023         1221      1024.00
    2073.599     0.999121         1221      1137.78
    2217.983     0.999219         1222      1280.00
    2217.983     1.000000         1222          inf
#[Mean    =      807.854, StdDeviation   =      153.096]
#[Max     =     2215.936, Total count    =         1222]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1881 requests in 30.12s, 1.86GB read
  Socket errors: connect 0, read 0, write 0, timeout 90
Requests/sec:     62.44
Transfer/sec:     63.11MB