wrk2/dome-no-cache/1024KB/wrk-wlan0-rep08.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 754.799ms, rate sampling interval: 1918ms
  Thread calibration: mean lat.: 592.121ms, rate sampling interval: 1759ms
  Thread calibration: mean lat.: 688.991ms, rate sampling interval: 2187ms
  Thread calibration: mean lat.: 351.255ms, rate sampling interval: 734ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   540.41ms  272.66ms   3.16s    72.16%
    Req/Sec    17.40     10.24    36.00     61.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  577.02ms
 75.000%  695.29ms
 90.000%  791.55ms
 99.000%    1.29s 
 99.900%    2.68s 
 99.990%    3.16s 
 99.999%    3.16s 
100.000%    3.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      41.663     0.000000            1         1.00
     196.479     0.100000          141         1.11
     269.567     0.200000          281         1.25
     384.511     0.300000          421         1.43
     517.887     0.400000          561         1.67
     577.023     0.500000          701         2.00
     597.503     0.550000          773         2.22
     614.911     0.600000          841         2.50
     636.415     0.650000          911         2.86
     661.503     0.700000          981         3.33
     695.295     0.750000         1051         4.00
     707.071     0.775000         1086         4.44
     720.895     0.800000         1121         5.00
     739.327     0.825000         1157         5.71
     751.615     0.850000         1191         6.67
     771.071     0.875000         1226         8.00
     779.263     0.887500         1244         8.89
     791.551     0.900000         1261        10.00
     804.351     0.912500         1279        11.43
     825.343     0.925000         1296        13.33
     850.431     0.937500         1314        16.00
     859.647     0.943750         1324        17.78
     875.007     0.950000         1331        20.00
     888.319     0.956250         1340        22.86
     913.407     0.962500         1349        26.67
     949.759     0.968750         1358        32.00
     999.423     0.971875         1362        35.56
    1078.271     0.975000         1366        40.00
    1170.431     0.978125         1371        45.71
    1198.079     0.981250         1375        53.33
    1223.679     0.984375         1380        64.00
    1244.159     0.985938         1382        71.11
    1260.543     0.987500         1384        80.00
    1277.951     0.989062         1386        91.43
    1305.599     0.990625         1388       106.67
    1345.535     0.992188         1391       128.00
    1350.655     0.992969         1392       142.22
    1374.207     0.993750         1393       160.00
    1401.855     0.994531         1394       182.86
    1813.503     0.995313         1395       213.33
    2164.735     0.996094         1396       256.00
    2189.311     0.996484         1397       284.44
    2189.311     0.996875         1397       320.00
    2217.983     0.997266         1398       365.71
    2217.983     0.997656         1398       426.67
    2232.319     0.998047         1399       512.00
    2232.319     0.998242         1399       568.89
    2232.319     0.998437         1399       640.00
    2682.879     0.998633         1400       731.43
    2682.879     0.998828         1400       853.33
    2682.879     0.999023         1400      1024.00
    2682.879     0.999121         1400      1137.78
    2682.879     0.999219         1400      1280.00
    3162.111     0.999316         1401      1462.86
    3162.111     1.000000         1401          inf
#[Mean    =      540.414, StdDeviation   =      272.662]
#[Max     =     3160.064, Total count    =         1401]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2107 requests in 30.13s, 2.09GB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:     69.94
Transfer/sec:     70.92MB